import telebot

BOT_TOKEN = "8237331252:AAFxe6oZusRF1RRMsFRHjiL4qCJ6NM3s65I"
ADMIN_CHAT_IDS = [738258564,2110398264]


bot = telebot.TeleBot(BOT_TOKEN)


@bot.message_handler(commands=['start'])
def send_welcome(message):
    text = (
        "Здравствуйте! 👋\n"
        "Я ассистент адвоката.\n\n"
        "Чтобы задать вопрос и записаться на консультацию, пожалуйста, напишите сообщение в таком формате:\n\n"
        "1️⃣ Ваше имя\n"
        "2️⃣ Как с вами связаться (телефон, Telegram или e-mail)\n"
        "3️⃣ Кратко опишите вашу ситуацию\n"
        "4️⃣ Удобное время для связи\n\n"
        "Вы можете прикрепить документы или фотографии.\n"
        "Ваше сообщение будет передано адвокату конфиденциально."
    )
    bot.reply_to(message, text)


@bot.message_handler(content_types=['text', 'photo', 'document'])
def handle_any_message(message):

    # Пересылаем сообщение всем администраторам
    for admin_id in ADMIN_CHAT_IDS:
        bot.forward_message(
            admin_id,
            message.chat.id,
            message.message_id
        )

    # 2. Сообщение клиенту
    bot.reply_to(
        message,
        "Спасибо! 🙏\nВаше сообщение получено и передано адвокату. "
        "С вами свяжутся после ознакомления."
    )


print("Бот запущен...")
bot.infinity_polling()
